src/config/InformationRegisters/БонусыПоставщиковИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>БонусыПоставщиковИнтернетМагазина</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/БонусыПоставщиковИнтернетМагазина/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Запрос = новый Запрос;

	//ЭтотОбъект.Прочитать();
	Таб =  ЭтотОбъект.Выгрузить(,"Период, Приоритет, Производитель, Модель, НоменклатурнаяГруппа, Диаметр, Номенклатура");
	Запрос.УстановитьПараметр("тзЗаписей",Таб);
	Запрос.Текст="ВЫБРАТЬ
	             |	тзЗаписей.Период,
	             |	тзЗаписей.Приоритет,
	             |	тзЗаписей.Производитель,
	             |	тзЗаписей.Модель,
	             |	тзЗаписей.НоменклатурнаяГруппа,
	             |	тзЗаписей.Диаметр,
	             |	тзЗаписей.Номенклатура
	             |ПОМЕСТИТЬ втЗаписей
	             |ИЗ
	             |	&тзЗаписей КАК тзЗаписей
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	втЗаписей.Период,
	             |	втЗаписей.Приоритет,
	             |	втЗаписей.Производитель,
	             |	втЗаписей.Модель,
	             |	втЗаписей.НоменклатурнаяГруппа,
	             |	втЗаписей.Диаметр
	             |ИЗ
	             |	втЗаписей КАК втЗаписей
	             |ГДЕ
	             |	НЕ (втЗаписей.Период, втЗаписей.Приоритет, втЗаписей.Производитель, втЗаписей.Модель, втЗаписей.НоменклатурнаяГруппа, втЗаписей.Диаметр, втЗаписей.Номенклатура) В
	             |				(ВЫБРАТЬ
	             |					БонусыПоставщиковИнтернетМагазина.Период,
	             |					БонусыПоставщиковИнтернетМагазина.Приоритет,
	             |					БонусыПоставщиковИнтернетМагазина.Производитель,
	             |					БонусыПоставщиковИнтернетМагазина.Модель,
	             |					БонусыПоставщиковИнтернетМагазина.НоменклатурнаяГруппа,
	             |					БонусыПоставщиковИнтернетМагазина.Диаметр,
	             |					БонусыПоставщиковИнтернетМагазина.Номенклатура
	             |				ИЗ
	             |					РегистрСведений.БонусыПоставщиковИнтернетМагазина КАК БонусыПоставщиковИнтернетМагазина)
	             |	И (втЗаписей.Период, втЗаписей.Приоритет) В
	             |			(ВЫБРАТЬ
	             |				БонусыПоставщиковИнтернетМагазина.Период,
	             |				БонусыПоставщиковИнтернетМагазина.Приоритет
	             |			ИЗ
	             |				РегистрСведений.БонусыПоставщиковИнтернетМагазина КАК БонусыПоставщиковИнтернетМагазина)";
				 
				 Рез = Запрос.Выполнить().Выбрать();
				 Пока Рез.Следующий() Цикл
					 Сообщить("В периоде "+ рез.Период+" уже есть правило с приоритетом "+рез.Приоритет);
					 Отказ = истина;
				 КонецЦикла;

КонецПроцедуры
